In [21]:
import pandas as pd
import numpy as np

In [2]:
original_df = pd.read_csv('Sales_Data.csv')
original_df.head()

,Unnamed: 0,Order ID,Product Category,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Sales,City,Hour,Time of Day
0,0,295665,Laptops and Computers,Macbook Pro Laptop,1,1700.00,30-12-2019 00:01,"136 Church St, New York City, NY 10001",12,1700.00,New York City,0,Night
1,1,295666,Home Appliances,LG Washing Machine,1,600.00,29-12-2019 07:03,"562 2nd St, New York City, NY 10001",12,600.00,New York City,7,Morning
2,2,295667,Charging Cables,USB-C Charging Cable,1,11.95,12-12-2019 18:21,"277 Main St, New York City, NY 10001",12,11.95,New York City,18,Evening
3,3,295668,Monitors,27in FHD Monitor,1,149.99,22-12-2019 15:13,"410 6th St, San Francisco, CA 94016",12,149.99,San Francisco,15,Afternoon
4,4,295669,Charging Cables,USB-C Charging Cable,1,11.95,18-12-2019 12:38,"43 Hill St, Atlanta, GA 30301",12,11.95,Atlanta,12,Afternoon

In [3]:
df = original_df.copy()
df = pd.read_csv('Sales_Data.csv')

In [4]:
print(df.shape)
print(df.head(2))

(185950, 13)
   Unnamed: 0  Order ID       Product Category             Product  \
0           0    295665  Laptops and Computers  Macbook Pro Laptop
1           1    295666        Home Appliances  LG Washing Machine

   Quantity Ordered  Price Each        Order Date  \
0                 1      1700.0  30-12-2019 00:01
1                 1       600.0  29-12-2019 07:03

                         Purchase Address  Month   Sales            City  \
0  136 Church St, New York City, NY 10001     12  1700.0   New York City
1     562 2nd St, New York City, NY 10001     12   600.0   New York City

   Hour Time of Day
0     0       Night
1     7     Morning

In [5]:
df.shape

(185950, 13)

In [6]:
df.describe()

,Unnamed: 0,Order ID,Quantity Ordered,Price Each,Month,Sales,Hour
count,185950.000000,185950.000000,185950.000000,185950.000000,185950.000000,185950.000000,185950.000000
mean,8340.388475,230417.569379,1.124383,184.399735,7.059140,185.490917,14.413305
std,5450.554093,51512.737110,0.442793,332.731330,3.502996,332.919771,5.423416
min,0.000000,141234.000000,1.000000,2.990000,1.000000,2.990000,0.000000
25%,3894.000000,185831.250000,1.000000,11.950000,4.000000,11.950000,11.000000
50%,7786.000000,230367.500000,1.000000,14.950000,7.000000,14.950000,15.000000
75%,11872.000000,275035.750000,1.000000,150.000000,10.000000,150.000000,19.000000
max,25116.000000,319670.000000,9.000000,1700.000000,12.000000,3400.000000,23.000000

# Loading Monthly_sales

In [7]:
Monthly_sales = df[
    ["Month" ,"Sales" , "City", "Hour","Time of Day"]].drop_duplicates()
Monthly_sales.shape

(43599, 5)

In [8]:
Monthly_sales.columns

Index(['Month', 'Sales', 'City', 'Hour', 'Time of Day'], dtype='object')

In [9]:
Monthly_sales

        Month    Sales            City  Hour Time of Day
0          12  1700.00   New York City     0       Night
1          12   600.00   New York City     7     Morning
2          12    11.95   New York City    18     Evening
3          12   149.99   San Francisco    15   Afternoon
4          12    11.95         Atlanta    12   Afternoon
...       ...      ...             ...   ...         ...
185885      6   300.00         Atlanta    17   Afternoon
185889      6   109.99   New York City     1       Night
185896      6    23.98        Portland    22     Evening
185907      6     7.68          Dallas     8     Morning
185942      6   700.00   New York City    22     Evening

[43599 rows x 5 columns]

# Montly_Sales by Product

In [10]:
Monthly_product_sales = (df.groupby(['Month', 'Product'])['Sales'].sum().reset_index())

Monthly_product_sales

     Month                 Product      Sales
0        1            20in Monitor   23977.82
1        1  27in 4K Gaming Monitor  122066.87
2        1        27in FHD Monitor   63295.78
3        1  34in Ultrawide Monitor  119316.86
4        1   AA Batteries (4-pack)    5468.16
..     ...                     ...        ...
223     12         ThinkPad Laptop  538994.61
224     12    USB-C Charging Cable   38837.50
225     12         Vareebadd Phone  113600.00
226     12        Wired Headphones   32960.51
227     12                  iPhone  634200.00

[228 rows x 3 columns]

# Monthly Sales by City

In [11]:
Monthly_city_sales = (df.groupby(['Month', 'City'])['Sales'].sum().reset_index())

Monthly_city_sales

     Month            City       Sales
0        1         Atlanta   149159.54
1        1          Austin    88087.06
2        1          Boston   201088.49
3        1          Dallas   143462.51
4        1     Los Angeles   288601.90
..     ...             ...         ...
103     12     Los Angeles   684044.84
104     12   New York City   646770.83
105     12        Portland   303714.11
106     12   San Francisco  1106601.27
107     12         Seattle   387317.93

[108 rows x 3 columns]

# Monthly Sales by Hour

In [12]:
Monthly_hour_sales = (df.groupby(['Month', 'Hour'])['Sales'] .sum() .reset_index())
Monthly_hour_sales

     Month  Hour      Sales
0        1     0   42715.96
1        1     1   24645.65
2        1     2   17600.97
3        1     3    6798.74
4        1     4    6418.30
..     ...   ...        ...
283     12    19  323274.15
284     12    20  321235.30
285     12    21  255373.54
286     12    22  212241.78
287     12    23  157913.20

[288 rows x 3 columns]

# Monthly Sales by Time of Day

In [13]:
Monthly_time_sales = ( df.groupby(['Month', 'Time of Day'])['Sales'] .sum() .reset_index())

Monthly_time_sales

    Month Time of Day       Sales
0       1   Afternoon   630741.00
1       1     Evening   625176.41
2       1     Morning   460509.01
3       1       Night   105830.31
4       2   Afternoon   805957.41
5       2     Evening   775722.51
6       2     Morning   499779.37
7       2       Night   120563.13
8       3   Afternoon  1038036.47
9       3     Evening   950695.56
10      3     Morning   674217.76
11      3       Night   144150.59
12      4   Afternoon  1211499.36
13      4     Evening  1145035.08
14      4     Morning   836105.02
15      4       Night   198030.78
16      5   Afternoon  1147431.63
17      5     Evening  1069252.31
18      5     Morning   752172.10
19      5       Night   183750.71
20      6   Afternoon   916706.82
21      6     Evening   881998.87
22      6     Morning   618831.59
23      6       Night   160264.98
24      7   Afternoon   933449.01
25      7     Evening   930258.49
26      7     Morning   645914.40
27      7       Night   138153.86
28      8   Afternoon   837913.56
29      8     Evening   755329.31
30      8     Morning   531373.40
31      8       Night   119851.61
32      9   Afternoon   765884.85
33      9     Evening   714369.63
34      9     Morning   489490.57
35      9       Night   127815.08
36     10   Afternoon  1389072.99
37     10     Evening  1237380.04
38     10     Morning   889110.09
39     10       Night   221163.76
40     11   Afternoon  1189366.31
41     11     Evening  1101708.16
42     11     Morning   738844.98
43     11       Night   169683.75
44     12   Afternoon  1665336.98
45     12     Evening  1555931.22
46     12     Morning  1132895.39
47     12       Night   259279.75

# Maximum Sales Month

In [14]:
monthly_sales = df.groupby('Month')['Sales'].sum()

max_month = monthly_sales.idxmax()
max_month_sales = monthly_sales.max()

max_month, max_month_sales

(12, 4613443.34)

# Top Product per Month

In [15]:
monthly_product_sales = (df.groupby(['Month', 'Product'])['Sales'].sum().reset_index())
top_product_each_month = monthly_product_sales.loc[monthly_product_sales.groupby('Month')['Sales'].idxmax()]

top_product_each_month

     Month             Product      Sales
13       1  Macbook Pro Laptop   399500.0
32       2  Macbook Pro Laptop   469200.0
51       3  Macbook Pro Laptop   644300.0
70       4  Macbook Pro Laptop   771800.0
89       5  Macbook Pro Laptop   790500.0
108      6  Macbook Pro Laptop   605200.0
127      7  Macbook Pro Laptop   625600.0
146      8  Macbook Pro Laptop   508300.0
165      9  Macbook Pro Laptop   489600.0
184     10  Macbook Pro Laptop   892500.0
203     11  Macbook Pro Laptop   748000.0
222     12  Macbook Pro Laptop  1093100.0

# Find TOP values

In [16]:
Monthly_product_sales.sort_values('Sales', ascending=False).head(10)

     Month             Product       Sales
222     12  Macbook Pro Laptop  1093100.00
184     10  Macbook Pro Laptop   892500.00
89       5  Macbook Pro Laptop   790500.00
70       4  Macbook Pro Laptop   771800.00
203     11  Macbook Pro Laptop   748000.00
51       3  Macbook Pro Laptop   644300.00
227     12              iPhone   634200.00
127      7  Macbook Pro Laptop   625600.00
108      6  Macbook Pro Laptop   605200.00
223     12     ThinkPad Laptop   538994.61

# Total sales per month

In [17]:
monthly_sales = df.groupby('Month')['Sales'].sum()
monthly_sales

Month
1     1822256.73
2     2202022.42
3     2807100.38
4     3390670.24
5     3152606.75
6     2577802.26
7     2647775.76
8     2244467.88
9     2097560.13
10    3736726.88
11    3199603.20
12    4613443.34
Name: Sales, dtype: float64